app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My post title"], ["description", "My post description"], ["updated_at", "2018-11-26 22:49:51.309209"], ["id", 1]]
---
  def create
  @post = Post.create
  @post.title = params[:title]
  @post.description = params[:description]
  @post.save